# 문자열과 내장함수


#str = "멋쟁이 사자처럼"
#str2 = "는 좋은 동아리입니다. "

#print(str + str2)

# 문자열 길이: len(문자열변수)

# 문자열 내에사 특정 문자의 등장 횟수: 문자열변수.count('특정 문자')

#문자열의 특정 기준으로 나누기: 문자열 변수.split() -> ()안에 아무것도 없을 땐 공백 ->리스트에 저장

#특정 문자의 인덱스 찾기: find('문자'), index('문자')


#----------------------------------------------

#리스트와 내장함수

#li = [3, 1, '배가', 4, '고파요', 5, 1]

# 리스트의 길이: len(리스트 변수)

# 리스트 오름차순 정령: 변수.sort()

#리스트 내의 특정 원소 인덱스 반환: .index()

#리스트 내의 특정 원소의 개수: .count()

#---------------------------------------------


#딕셔너리와 내장함수

#pairs = {'잔나비': '주저하는 연인들을 위해', '김광석': '그건 너의 자신을 사랑하지 않는 때문이야', '노라조': '형'}

#하나의 키-value 쌍을 추가하는 방법

#변수[키] = 값

# =특정 키와 값을 삭제하는 방법
# del 변수[키]

#키로 값을 얻기: 변수.get(키)
